Repository: data-man/klatexformula
Catalog: po/*.po
Languages: fr

source: _: NAME OF TRANSLATORS Your names
fr: Philippe Faist

source: _: EMAIL OF TRANSLATORS Your emails
fr: Philippe Faist <philippe.faist@bluewin.ch>

source: KLatexFormula Command-line interface -- Easily get an image from a LaTeX equation
fr: Interface ligne de commande de KLatexFormula - Obtenez facilement une image d'une équation LaTeX

source: An input file to parse, '-' for standard input.
fr: Fichier d'entrée à lire, '-' pour l'entrée standard stdin.

source: A File to write to or '-' for standard output. Format is guessed by extention and defaults to PNG.
fr: Fichier de sortie ou '-' pour la sortie standard. Le format est deviné à partir de l'extension, sinon PNG par défaut.

source: A foreground color. Format #FFFFFF. (Don't forget to escape \# from the shell!)
fr: Couleur à appliquer. Format #FFFFFF. (Ne pas oublier de protéger le \# du shell bash !)

source: A background color. Format #FFFFFF or '-' for transparent.
fr: Couleur d'arrière-plan. Format #FFFFFF ou '-' pour transparent.

source: DPI (dots per inch) pixelisation to use.
fr: DPI (dots per inch) résolution du rendu d'image en points par pouce.

source: Use given math mode. <arg> must contain '...' to be replaced by the latex string.
fr: Spécifiez le mode mathématique LaTeX. '...' doit figurer dans <arg> et sera remplacé par le code LaTeX en entrée.

source: Some arbitrary LaTeX code to be inserted after \documentclass{} and before \begin{document}. This may typically be \usepackage{xyz} directives.
fr: Code LaTeX arbitraire à insérer entre les directives \documentclass{} et \begin{document}, typiquement des instructions \usepackage{xyz}.

source: Print as little as possible on standard error. Error messages won't be printed. Errors will be reported with exit status.
fr: Afficher le moins possible en sortie d'erreur stderr. Les messages d'erreur ne seront pas affichés, les erreurs sont signalées par le code de retour du programme.

source: A writable temporary directory. If empty, a suitable directory (like /tmp) will be used.
fr: Un dossier temporaire avec accès en écriture. Par défaut, un dossier adéquat comme /tmp sera utilisé.

source: Path and file name to 'latex' executable. If 'latex' is installed normally and is accessible in $PATH, you don't need to specify any path here.
fr: Chemin d'accès et nom de fichier pour le programme 'latex'. Si 'latex' est installé normalement et accessible dans $PATH, ne spécifiez rien ici.

source: Path and file name to 'dvips' executable. If 'dvips' is installed normally and is accessible in $PATH, you don't need to specify any path here.
fr: Chemin d'accès et nom de fichier pour le programme 'dvips'. Si 'dvips' est installé normalement et accessible dans $PATH, ne spécifiez rien ici.

source: Path and file name to 'gs' executable. If 'gs' is installed normally and is accessible in $PATH, you don't need to specify any path here.
fr: Chemin d'accès et nom de fichier pour le programme 'gs'. Si 'gs' est installé normalement et accessible dans $PATH, ne spécifiez rien ici.

source: Path and file name to 'epstopdf' executable. If 'epstopdf' is installed normally and is accessible in $PATH, you don't need to specify any path here. If this argument is set to empty, PDF will not be available.
fr: Chemin d'accès et nom de fichier pour le programme 'epstopdf'. Si 'epstopdf' est installé normalement et accessible dans $PATH, ne spécifiez rien ici.

source: A left border offset for image (Postscript points). Default value recommended.
fr: Un espace à gauche (bordure) pour l'mage, en points Postscript. Valeur par défaut recommandée.

source: A top border offset for image (Postscript points). Default value recommended.
fr: Un espace en haut (bordure) pour l'mage, en points Postscript. Valeur par défaut recommandée.

source: A right border offset for image (Postscript points). Default value recommended.
fr: Un espace à droite (bordure) pour l'mage, en points Postscript. Valeur par défaut recommandée.

source: A bottom border offset for image (Postscript points). Default value recommended.
fr: Un espace en bas (bordure) pour l'mage en points Postscript. Valeur par défaut recommandée.

source: KLatexFormula Cmdline interface
fr: Interface Line de Commande KLatexFormula

source: Right click for context menu, double-click to restore LaTeX formula.
fr: Bouton droit pour menu, double-clic pour rappeller la formule LaTeX.

source: Configure display
fr: Configurer l'affichage

source: Only display tagged items
fr: Afficher seulement les éléments marqués

source: Restore latex formula and style
fr: Rétablir la formule et le style

source: Restore latex formula only
fr: Rétablir la formule

source: Delete from history
fr: Supprimer de l'historique

source: Are you sure you want to delete selected item(s) from history?
fr: Etes-vous sûr de vouloir effacer les éléments sélectionnés ?

source: delete from history?
fr: effacer de l'historique ?

source: Preview
fr: Miniature

source: LaTeX formula
fr: Formule LaTeX

source: KLatexFormula History Browser
fr: Historique de Formules KLatexFormula

source: Search:
fr: Recherche :

source: Incremental search within history items. Find next with F3 key.
fr: Recherche dans la liste de formules. Trouvez l'occurrence suivante avec la touche F3.

source: If you insert keywords as LaTeX comments in your formulas ('<tt>%keyword</tt><i>[newline]</i>') then you can search for those formulas here.
fr: Si vous avez « marqué » vos formules avec des mots-clefs, alors vous pouvez les rechercher en saisissant votre mot-clef ici.

source: Clr>
fr: X>

source: Clear Search bar
fr: Effacer la barre de recherche

source: Restore Form&ula and style
fr: Rétablir la formule et le style

source: Restore current selected formula to KLatexFormula editor, with style
fr: Rétablir la formule sélectionnée dans l'éditeur de formules, avec le style.

source: Restore Formula onl&y
fr: Rétablir la formule

source: Restore LaTeX code only and keep the current style
fr: Rétablir la formule seulement et garder le style actuel

source: Delete item(s)
fr: Effacer les éléments sélectionnés

source: Delete de selected history items
fr: Effacer les éléments sélectionnés

source: Co&nfig
fr: Configuration

source: Cl&ose
fr: Fermer

source: Close this window
fr: Fermer cette fenêtre

source: Please wait while generating symbol previews ...
fr: Patientez svp. pendant la génération des miniatures des symboles ...

source: Error reading latex symbols file! Check your installation!
fr: Erreur pendant la lecture du fichier de symboles latex ! Vérifiez votre installation !

source: Click an item to view its LaTeX code. Double-click inserts the symbol.
fr: Sélectionnez un élément pour voir son code LaTeX. Double-clic pour insérer ce symbole.

source: KLatexFormula - LaTeX symbols
fr: KLatexFormula - Symboles LaTeX

source: Choose symbol category
fr: Choisissez la catégorie

source: This is the selected symbol's LaTeX code
fr: Ici s'affiche le code du symbole sélectionné

source: I&nsert
fr: I&nsérer

source: Insert the selected symbol in KLatexFormula editor
fr: Insérer le symbole sélectionné dans l'éditeur de formule.

source: Close this dialog
fr: Fermer cette fenêtre.

source: Evaluate
fr: Evaluer

source: Available Styles
fr: Styles disponibles

source: Manage Styles
fr: Gérer les styles

source: Error: Unable to load your style list!
fr: Erreur : Impossible de lire la liste de styles !

source: Error: Style file is incorrect or corrupt!
fr: Erreur : Le fichier de styles est illisible ou corrompu !

source: The style file found was created by a more recent version of KLatexFormula. The process of style loading may fail.
fr: Le fichier de styles trouvé a été généré par une version postérieure de KLatexFormula. Sa lecture peut échouer.

source: Load styles
fr: Chargement des styles

source: Error: Unable to make local file for saving styles!
fr: Erreur : impossible de créer un fichier local pour la sauvegarde des styles !

source: Error: Unable to write to styles file!
fr: Erreur : Impossible d'écrire dans le fichier de styles !

source: Unable to load your formula history list!
fr: Impossible de lire l'historique de formules !

source: Error: History file is incorrect or corrupt!
fr: Erreur : Le fichier d'historique est illisible ou corrompu !

source: The history file found was created by a more recent version of KLatexFormula. The process of history loading may fail.
fr: Le fichier d'historique a été généré par une version postérieure de KLatexFormula. Sa lecture peut échouer.

source: Load history
fr: Chargement de l'historique

source: KLatexFormula has detected a history file from an older version of KLatexFormula. Do you wish to import those items?
fr: KLatexFormula a décelé un fichier d'historique datant d'une version antérieure de KLatexFormula. Aimeriez-vous importer ces éléments ?

source: Import old history?
fr: Importer vieil historique ?

source: Unable to load your old formula history list!
fr: Impossible de lire l'ancien fichier d'historique !

source: [old style import]
fr: [ancien style importé]

source: Error: Unable to make local file for saving history!
fr: Erreur : Impossible de créer un fichier local pour la sauvegarde de l'historique !

source: Error: Unable to write to history file!
fr: Erreur : Impossible d'écrire dans le fichier d'historique !

source: Error: %1
fr: Erreur : %1

source: *.%1|%2 Image
fr: *.%1|Image %2

source: *.eps|EPS PostScript
fr: *.eps|Format PostScript EPS

source: *.pdf|PDF Portable Document Format
fr: *.pdf|Format PDF "Portable Document Format"

source: *.jpg|Standard JPEG Image
fr: *.jpg|Image JPEG Standard

source: *.png|Standard PNG Image
fr: *.png|Image PNG Standard

source: Save Image Formula
fr: Enregistrer l'image

source: Specified file exists. Overwrite?
fr: Ce fichier existe déjà. Ecraser ?

source: Overwrite?
fr: Ecraser ?

source: Sorry, format `%1' is not available.
fr: Le format `%1' n'est malheureusement pas disponible.

source: No %1
fr: Pas de %1

source: [ no name ]
fr: [ sans nom ]

source: Enter name
fr: Saisissez le nom

source: Enter new style name:
fr: Saisissez le nom du nouveau style :

source: New Style
fr: Nouveau Style

source: Style name already exists. Do you want to overwrite?
fr: Ce nom de style existe déjà. Ecraser ?

source: Style name exists
fr: Nom de style existe déjà

source: Enter <i>LaTeX</i> expression:
fr: Saississez l'expression <i>LaTeX</i> :

source: <p>Enter your LaTeX formula here.</p><p>You may insert keywords using LaTeX comments, for future history searches:<br><tt>% keyword(s)<br><i>formula</i></p>
fr: <p>Saississez l'équation LaTeX ici.</p> <p>Vous pouvez insérer des mots-clef en utilisant des commentaires LaTeX, pour une recherche future dans l'historique, comme ceci :<br> <tt>% mots-clef<br><i>formule</i></tt></p>

source: Enter your <i>LaTeX</i> formula here. Then, by clicking the <i>Evaluate</i> button, you'll get the result you are waiting for.
fr: Saississez votre formula <i>LaTeX</i> ici. Ensuite, en cliquant le bouton <i>Evaluer</i>, vous obtenez le résultat attendu.

source: Clear the above field
fr: Vider le champ ci-dessus

source: Clicking this button is a utility to clear the LaTeX code entry field above
fr: Petit bouton utile pour effacer complètement le champ principal ci-dessus

source: Ev&aluate
fr: Ev&aluer

source: Evaluate LaTeX Expression [Shift-Enter]
fr: Evaluer l'expression LaTeX [Shift-Entrée]

source: Render the above <i>LaTeX</i> formula as an image, which will be displayed in the label below.
fr: Créer l'image à partir de l'équation <i>LaTeX</i> ci-dessus, qui sera affichée ci-dessous.

source: Show Latex Symbols palette
fr: Afficher la palette de symboles LaTeX

source: Clicking this button opens a dialog allowing you to view and select LaTeX symbols the codes of which you may not know by heart.
fr: Ce bouton ouvre une fenêtre qui affiche une palette de symboles LaTeX dont les codes auront peut-être échappé de votre mémoire.

source: Show History
fr: Afficher l'historique

source: Clicking this button opens a dialog allowing you to view previously entered formulas.
fr: Ce bouton ouvre une fenêtre qui permet d'explorer les formules déjà saisies.

source: Ctrl+E, Ctrl+Space
fr: Ctrl+E, Ctrl+Espace

source: Toggle shrinked/expanded mode
fr: Passer en mode étendu / en mode simple.

source: Switches to expanded mode or back to shrinked mode. In expanded mode you get to choose more options.
fr: Passer en mode étendu si vous êtes en mode simple, et vice versa. En mode étendu, vous avez plus d'options à manipuler.

source: The resulting image will be displayed here
fr: L'image finale sera affichée ici.

source: Here you can see the image you get after evaluating your LaTeX code.
fr: Ici sera affichée l'image rendue de votre équation LaTeX.

source: DRAG
fr: GLISSER

source: Click and keep mouse button pressed to drag your formula to an other application
fr: Cliquez et gardez appuyé pour « glisser » la formule vers une autre application

source: COP&Y
fr: COPIER

source: Copy formula to clipboard
fr: Copier la formule

source: SAVE
fr: ENREGISTRER

source: Save formula to disk
fr: Enregistrer la formule sur le disque dur

source: Quit KLatexFormula
fr: Quitter KLatexFormula

source: Exit KLatexFormula
fr: Quitter KLatexFormula

source: Colors
fr: Couleurs

source: Foreground color:
fr: Couleur à appliquer :

source: Choose the resulting text color
fr: Choisissez la couleur d'avant-plan à appliquer à l'équation.

source: &Use transparent background
fr: &Utiliser un fond transparent

source: Check this if you want your formula to have a transparent background
fr: Cochez ici pour obtenir une image finale avec un fond transparent

source: Background color:
fr: Couleur de fond :

source: Choose the resulting background color
fr: Choisissez la couleur d'arrière-plan à utiliser.

source: LaTeX && Image settings
fr: LaTeX et options de l'image

source: Edit the LaTeX preamble. This is typically \usepackage{...} directives
fr: Editez le préambule LaTeX. Insérez ici typiquement les instructions \usepackage{} nécessaires.

source: Use Math mode:
fr: Utiliser le mode mathématique LaTeX :

source: Check this to use a LaTeX math mode
fr: Cochez ici pour utiliser le mode mathématique de LaTeX pour le rendu des formules.

source: Edit LaTeX preamble:
fr: Editer le préambule LaTeX :

source: DPI Resolution:
fr: Résolution DPI :

source: Which LaTeX math mode you want
fr: Le mode mathématique de LaTeX vous désirez

source: This lets you choose between different available LaTeX math modes. You may choose one in the list or add your own. If you add your own math mode, make sure the string contains '...' which will be replaced by formula at evaluation.
fr: Ce champ vous permet de choisir entre les différents modes « math » de LaTeX. Vous pouvez en choisir un déjà dans la liste ou en rajouter un à vous, auquel cas n'oubliez pas de mettre '...' qui sera remplacé par l'équation à évaluer.

source: Select the resolution of the resulting image
fr: Saississez la résolution DPI du rendu de l'image finale.

source: &Load Style
fr: Charger un Style

source: Load a previously saved style
fr: Charger un style sauvegardé précédemment

source: Save Style
fr: Enregistrer le style

source: Save current style (colors, etc.)
fr: Enregistrer le style actuel (couleurs, etc.)

source: Setti&ngs...
fr: Configuration ...

source: Edit KLatexFormula settings
fr: Modifier la configuration de KLatexFormula

source: An error occured!
fr: Une erreur est survenue !

source: Close dialog
fr: Fermer la fenêtre

source: KLatexFormula - Settings
fr: KLatexFormula - Configuration

source: Enable s&yntax highlighting
fr: Activer les couleurs syntaxiques

source: Whether to enable coloring your LaTeX code or not
fr: Activer ou non les couleurs dans l'éditeur de formules LaTeX.

source: Changes affect directly LaTeX formula editor.<br>You need to restart KLatexFormula to affect the preamble editor
fr: Les changements ici n'affectent que l'éditeur de formules.<br>Vous devez redémarrer KLatexFormula pour mettre à jour l'éditeur de préambule.

source: Keyword color:
fr: Mot-clef LaTeX :

source: Comment color:
fr: Commentaire LaTeX :

source: Highlight p&arens only, not whole expression
fr: Colorier seulement les parenthèses, pas toute l'expression

source: Paren match color:
fr: Fermeture parenthèse :

source: Paren mismatch color:
fr: Fermeture mauvaise parenthèse :

source: Highlight parens that aren't closed
fr: Colorier les parenthèses non fermées

source: Lonely paren color:
fr: Parenthèse non fermée :

source: LaTeX code editor font
fr: Police de l'éditeur de code LaTeX

source: Preview Tooltip on LaTeX formula display
fr: Agrandissement de l'image (visionnement « tooltip »)

source: Maximum size (width x height) :
fr: Taille maximale (largeur x hauteur)

source: &Appearance
fr: &Apparence

source: Temporary directory:
fr: Dossier temporaire :

source: H&ave epstopdf
fr: epstopdf est installé sur mon système

source: Reset defaults
fr: Restaurer options par défaut

source: System E&xecutables and paths
fr: Exécutables et chemins d'accès

source: Expand EPS BoundingBox
fr: Agrandir la « BoundingBox EPS »

source: Left (Postscript points):
fr: A gauche (points postscript) :

source: Top (Postscript points):
fr: En haut (points postscript) :

source: Right (Postscript points):
fr: A droite (points postscript) :

source: Bottom (Postscript points):
fr: En bas (points postscript) :

source: Advanced &settings
fr: Config. Avancée

source: Ctrl+Return, Alt+O
fr: Ctrl+Entree, Alt+O

source: Ca&ncel
fr: Annuler

source: Style Management Actions
fr: Gestion des Styles

source: Delete Style
fr: Supprimer le style

source: Move up
fr: Déplacer vers le haut

source: Move down
fr: Déplacer vers le bas

source: Rename style
fr: Renommer le style

source: Drag and drop styles to move them. Right-click for actions menu.
fr: Glissez les styles pour les déplacer. Clic du bouton droit pour un menu.

source: Are you sure you want to erase selected style?
fr: Etes-vous sûr de vouloir écraser le style sélectionné ?

source: Erase style?
fr: Supprimer le style ?

source: Enter new style name:
fr: Saississez le nouveau nom du style :

source: KLatexFormula - Style Manager
fr: KLatexFormula - Gestion des Styles

source: Choose an action
fr: Choisissez une action

source: Close window
fr: Fermer la fenêtre

source: KLatexFormula -- Easily get an image from a LaTeX equation
fr: KLatexFormula - Obtenez une image facilement d'une équation LaTeX
